{
	"projects" : 
	[
		{
			"id" : 0,
			"name" : "HotSpot",
			"description" : "An Android application for automatically commecting to a Wi-Fi network by scanning a network name + key combination. HotSpot was an official entry to NWHacks 2018 where we had 24 hours to complete the project.",
			"github_link" : "https://github.com/hotspot-NWHacks2018/hotspot-app",
			"tags" : ["android", "java"],
			"image_link" : "hotspot2.jpg",
			"featured_status" : "featured"
		},
		{
			"id" : 1,
			"name" : "DigiExpress",
			"description" : "This web app mock-up was built with ASP.NET deployed in Azure and uses Azure databases. DigiExpress is a store where a user can buy and choose the parts for a laptop/desktop computer. This web app includes a feature for having items in a cart as well as viewing order history.",
			"github_link" : "https://github.com/jessicaprt/online-computer-store",
			"tags" : ["ASP.NET", "C#", "web"],
			"image_link" : "digiexpress2.jpg",
			"featured_status" : "featured"
		},
		{
			"id" : 2,
			"name" : "Blog Generator",
			"description" : "Blog Generator is a simple python script that converts a json file (containing the blog contents and details) to a static web page (in html). The aim of this project is to make blogging easier and avoids hosting costs (free with Github pages)",
			"github_link" : "https://github.com/jessicaprt/website-latest/tree/master/blog-generator",
			"tags" : ["python", "web"],
			"image_link" : "blog-generator.jpg",
			"featured_status" : "featured"
		},
		{
			"id" : 3,
			"name" : "HeproTech",
			"description" : "a device for securing contents in a case where a user can enable \"secure mode\" and receives alerts via a notification on a monile phone if someone else comes close to the secure case. Hepro-tech was an entry to CalgaryHacks where we had 24 hours to complete the project.",
			"github_link" : "https://github.com/hepro-tech",
			"tags" : ["android", "hardware"],
			"image_link" : "heprotech.JPG",
			"featured_status" : null
		},
		{
			"id" : 4,
			"name" : "Habit Manager",
			"description" : "This app was part of my group school project. Habit manager is an app that tracks habit tasks that a user might want to accomplish on certain days of the week. You can also visit other user's profiles and follow them to know when they have successfully completed a habit task.",
			"github_link" : "https://github.com/CMPUT301F17T15/CIA",
			"tags" : ["android", "java"],
			"image_link" : "habit-manager.jpg",
			"featured_status" : null
		}
	]
}