{"blogs": [{"body": ["Hello friends! I have recently updated my entire website once again. Now that school's over and now that I have a bit more time to do things on my computer, I decided that I'd give my website a bit of \"re-design\". The first thing that I want to research more would be how to improve the blogging system without the use of database and solely relying on GitHub pages to take advantage of the free hosting capability. The other thing I want to work on when I do web dev is to be able to lessen the hard coded contents on my page and improve on how I render them on pages. It doesn't seem like a lot of work right now, and I might just be blabbering right now trying to write my first blog content at 1:30 in the morning. But hopefully here's a start to posting more blog contents on my site.", "Aside from just everything that has to do with computers, I hope to also post some of my activities on the daily including my travels, and other adventures.", "I'll leave things here for now. I'll post more soon!"], "blog_image": "daily-image.jpg", "title": "First Blog", "tags": ["web dev"], "created_at": "2018-05-08", "id": "0", "url": "first-blog"}, {"body": ["My favourite perks of living in Calgary is how close we are to the Canadian Rockies. Banff is a real gem in Canada and I am fortunate enough to be able to visit this beautiful place at least once per year", "There's a reason for our visit to Banff this year. My cousin got married and some of our relatives from Philippines and the US are visiting Calgary. Of course we had to take them to Banff. To a lot of them, it was their first time visiting it. We went on the Gondola and up to Sulphur Mountain (where the picture above was taken). Although I have been to Banff multiple times, I rarely go to up the Gondola because the tickets are a bit pricey. When we got up, we really got to enjoy the breathtaking view of the surrounding mountains.", "There's more to it than just riding the Gondola and reaching the top of the moutain, the drop-off for the Gondola is the beginning of a trail to the highest point on Sulphur mountain, the Samson Peak. Reaching the peak will take some time because you'll be there to see the magnificent view as you walk. The trail is straight for the most part, but there's also quite a bit of stairs", "If you're travelling to Banff for the first time, I highly recommend going taking the trip up to Sulphur Mountain"], "blog_image": "another-banff-trip.JPG", "title": "Another Banff Trip", "tags": ["travel"], "created_at": "2018-05-31", "id": 1, "url": "another-banff-trip"} ]}